{
  "language-name": "Català",
  "description": "Lloc web personal de Felipe Graeff - Portafoli de desenvolupador de programari",
  "title": "Felipe Graeff | Desenvolupador de programari",
  "name": "Felipe Graeff",
  "position": "Desenvolupador de programari",
  "view-my-work-btn": "Veure el meu treball",
  "get-in-touch-btn": "Contacta amb mi",

  "about-me-title": "Sobre mi",
  "about-me-text": [
    "Hola! Em dic en Felipe, un desenvolupador de programari enfocat en el backend, amb una sòlida base en ciències de la computació i una gran passió per construir sistemes escalables, segurs i amb impacte real. M’agrada participar en projectes de codi obert i integrar serveis backend amb aplicacions del món real.",
    "La meva experiència abasta des de microserveis al núvol fins a projectes de recerca en criptografia i emmagatzematge segur de dades. Em sento còmode treballant en entorns col·laboratius i gaudeixo creant eines que milloren la manera com les persones interactuen amb la tecnologia.",
    "Estic constantment buscant formes d’alinear les meves habilitats tècniques amb reptes significatius, ja sigui en educació, infraestructura o desenvolupament de productes. Valoro el codi net, una arquitectura ben pensada i l’oportunitat d’aprendre i créixer amb un bon equip."
  ],

  "interests-title": "Interessos",

  "interests-distributed-title": "Sistemes distribuïts",
  "interests-distributed-desc": "Disseny i desenvolupament d’arquitectures escalables i orientades a serveis per a aplicacions reals.",

  "interests-security-title": "Seguretat i criptografia",
  "interests-security-desc": "Exploració de l’emmagatzematge segur de dades, esquemes de xifrat i disseny d’APIs amb enfocament en la privacitat.",

  "interests-iot-title": "Automatització i IoT",
  "interests-iot-desc": "Treball amb microcontroladors, domòtica i integració de maquinari i programari amb eines com Arduino.",

  "interests-languages-title": "Llengües i comunicació",
  "interests-languages-desc": "Estudi de les llengües naturals i de com persones i sistemes es comuniquen a través de cultures i plataformes.",

  "interests-collab-title": "Desenvolupament col·laboratiu",
  "interests-collab-desc": "Contribució a repositoris compartits, millora d’eines i creació de solucions en equip.",

  "skills-title": "Habilitats",

  "skills-level-label": "Nivell d’habilitat:",
  "skill-level-beginner": "Principiant",
  "skill-level-elementary": "Bàsic",
  "skill-level-intermediate": "Intermedi",
  "skill-level-advanced": "Avançat",
  "skill-level-expert": "Expert",

  "skill-category-programming-languages": "Llenguatges de programació",
  "skill-category-frameworks": "Frameworks i llibreries",
  "skill-category-databases": "Bases de dades i núvol",
  "skill-category-tools": "Eines i flux de treball",

  "projects-title": "Projectes",
  "view-project-btn": "Veure projecte",

  "project-maabe-title": "API segura MA-ABE",
  "project-maabe-caption": "API criptogràfica construïda amb Flask i Charm-Crypto",
  "project-maabe-desc": "Sistema de xifrat híbrid que combina MA-ABE amb AES, dissenyat per emmagatzemar de manera segura dades de dispositius IoT relacionades amb la salut. Inclou gestió de claus amb Redis i avaluació de rendiment amb Locust.",

  "project-crypto-title": "Plataforma d’intercanvi de criptomonedes",
  "project-crypto-caption": "Plataforma basada en microserveis",
  "project-crypto-desc": "Desenvolupament de serveis backend per a una plataforma d’intercanvi de criptoactius, amb autenticació segura mitjançant AWS Cognito, processament de transaccions i integració amb API Gateway. També s’integra amb serveis externs com CoinPayments. Desplegat amb Amazon ECS.",

  "project-iot-title": "Domòtica amb IoT",
  "project-iot-caption": "Sistema d’automatització basat en Arduino",
  "project-iot-desc": "Interruptor elèctric amb Wi-Fi desenvolupat amb Arduino i ESP8266, connectat a un mòdul de relés per controlar llums i electrodomèstics a distància. Inclou interfície web i comunicació MQTT per a monitoratge en temps real.",

  "project-cthread-title": "CThread",
  "project-cthread-caption": "Llibreria bàsica de fils en C",
  "project-cthread-desc": "Llibreria similar a PThreads per al llenguatge C. Desenvolupada com a part d’un curs de sistemes operatius, ofereix funcionalitats bàsiques per a la creació i sincronització de fils.",

  "project-capybot-title": "CapyBot",
  "project-capybot-caption": "Assistent d’IA amb temàtica de capibara per a Slack",
  "project-capybot-desc": "Aplicació per a Slack integrada amb l’API d’OpenAI, permetent al teu equip interactuar amb un simpàtic assistent d’IA estil capibara. Útil per tasques, generació d’idees o simplement fer temps entre desplegaments.",

  "project-shrek-title": "Shrek contra els cuirassats",
  "project-shrek-caption": "Un joc on en Shrek s’enfronta a una flota de cuirassats",
  "project-shrek-desc": "Petit joc desenvolupat íntegrament amb OpenGL per mostrar conceptes fonamentals de gràfics per ordinador com la il·luminació, els shaders, les textures, la detecció de col·lisions i les corbes de Bézier. Creat en el marc d’un curs universitari.",

  "project-compiler-title": "Mini compilador",
  "project-compiler-caption": "Compilador creat amb Lex i Yacc",
  "project-compiler-desc": "Compilador per a un llenguatge fictici desenvolupat com a part d’un curs de compiladors. Inclou anàlisi lèxica, anàlisi sintàctica, taula de símbols i gestió d’errors.",

  "project-snake-title": "Snake",
  "project-snake-caption": "El clàssic joc del mòbil, ara al terminal",
  "project-snake-desc": "Versió del joc Snake per terminal escrita en C, utilitzant la llibreria curses per gestionar l’entrada i la visualització. Dissenyada per practicar el control d’interfícies de baix nivell i les mecàniques del bucle del joc.",

  "formation-title": "Formació",
  "formation-course-cs": "Ciències de la Computació",
  "formation-uni-ufrgs": "Universitat Federal de Rio Grande do Sul",
  "formation-course-sad": "Anàlisi i desenvolupament de sistemes",
  "formation-uni-uniaselvi": "UNIASSELVI",

  "formation-certifications-title": "Esdeveniments i certificacions",
  "formation-cert-js": "Certificació avançada en JavaScript",
  "formation-cert-python": "Especialització en ciència de dades amb Python",
  "formation-cert-ruby": "Desenvolupament amb Ruby on Rails",

  "languages-title": "Idiomes",
  "languages-level-label": "Nivell de competència:",
  "language-level-beginner": "Principiant",
  "language-level-elementary": "Bàsic",
  "language-level-intermediate": "Intermedi",
  "language-level-advanced": "Avançat",
  "language-level-fluent": "Fluid",

  "lang-portuguese": "Portuguès",
  "lang-english": "Anglès",
  "lang-spanish": "Castellà",
  "lang-japanese": "Japonès",
  "lang-french": "Francès",
  "lang-catalan": "Català",
  "lang-german": "Alemany",
  "lang-arabic": "Àrab",

  "contact-title": "Contacte",
  "contact-description": "No dubtis a contactar amb mi a través d’algun dels canals següents:",
  "contact-email": "Correu electrònic",
  "contact-linkedin": "LinkedIn",
  "contact-github": "GitHub",

  "footer-text": "© 2024 Felipe Graeff | Desenvolupador de programari"
}
