{
  "language-name": "Español",
  "description": "Sitio personal de Felipe Graeff - Portafolio de Desarrollador de Software",
  "title": "Felipe Graeff | Desarrollador de Software",
  "name": "Felipe Graeff",
  "position": "Desarrollador de Software",
  "view-my-work-btn": "Ver mi trabajo",
  "get-in-touch-btn": "Contáctame",

  "about-me-title": "Sobre mí",
  "about-me-text": [
    "¡Hola! Soy Felipe, un desarrollador de software centrado en el backend, con una sólida formación en informática y una pasión por construir sistemas escalables, seguros e impactantes. Disfruto trabajando en proyectos de código abierto e integrando servicios backend en aplicaciones reales.",
    "Mi experiencia abarca desde microservicios en la nube hasta proyectos de investigación en criptografía y almacenamiento seguro de datos. Me desenvuelvo bien en entornos colaborativos y disfruto creando herramientas que mejoren la forma en que las personas interactúan con la tecnología.",
    "Siempre estoy explorando formas de alinear mis habilidades técnicas con retos significativos, ya sea en educación, infraestructuras o desarrollo de productos. Valoro el código limpio, una arquitectura bien pensada y la oportunidad de aprender y crecer con un gran equipo."
  ],

  "interests-title": "Intereses",

  "interests-distributed-title": "Sistemas Distribuidos",
  "interests-distributed-desc": "Diseño y construcción de arquitecturas orientadas a servicios y escalables para aplicaciones reales.",

  "interests-security-title": "Seguridad y Criptografía",
  "interests-security-desc": "Exploración del almacenamiento seguro de datos, esquemas de cifrado y diseño de APIs centradas en la privacidad.",

  "interests-iot-title": "Automatización e IoT",
  "interests-iot-desc": "Trabajo con microcontroladores, automatización del hogar e integración hardware-software con herramientas como Arduino.",

  "interests-languages-title": "Idiomas y Comunicación",
  "interests-languages-desc": "Estudio de lenguas naturales y de cómo personas y sistemas se comunican a través de culturas y plataformas.",

  "interests-collab-title": "Desarrollo Colaborativo",
  "interests-collab-desc": "Contribución a bases de código compartidas, mejora de herramientas y desarrollo de soluciones en equipo.",

  "skills-title": "Habilidades",

  "skills-level-label": "Nivel de habilidad:",
  "skill-level-beginner": "Principiante",
  "skill-level-elementary": "Básico",
  "skill-level-intermediate": "Intermedio",
  "skill-level-advanced": "Avanzado",
  "skill-level-expert": "Experto",

  "skill-category-programming-languages": "Lenguajes de Programación",
  "skill-category-frameworks": "Frameworks y Librerías",
  "skill-category-databases": "Bases de Datos y Nube",
  "skill-category-tools": "Herramientas y Flujo de Trabajo",

  "projects-title": "Proyectos",
  "view-project-btn": "Ver Proyecto",

  "project-maabe-title": "API Segura MA-ABE",
  "project-maabe-caption": "API criptográfica desarrollada con Flask y Charm-Crypto",
  "project-maabe-desc": "Un sistema de cifrado híbrido que combina MA-ABE con AES, diseñado para el almacenamiento seguro de datos de IoT relacionados con la salud. Incluye gestión de claves con Redis y evaluación de rendimiento con Locust.",

  "project-crypto-title": "Plataforma de Intercambio de Criptomonedas",
  "project-crypto-caption": "Plataforma de intercambio basada en microservicios",
  "project-crypto-desc": "Desarrollo de servicios backend para una plataforma de intercambio de criptoactivos, centrada en la autenticación segura con AWS Cognito, el procesamiento de transacciones y la integración con API Gateway. También se integra con servicios de terceros como CoinPayments. Desplegada en Amazon ECS.",

  "project-iot-title": "Automatización del Hogar con IoT",
  "project-iot-caption": "Sistema de automatización basado en Arduino",
  "project-iot-desc": "Desarrollo de un interruptor eléctrico con Wi-Fi usando Arduino y ESP8266, conectado a un módulo relé para controlar luces y electrodomésticos a distancia. Incluye interfaz web e integración con MQTT para comunicación y monitoreo en tiempo real.",

  "project-cthread-title": "CThread",
  "project-cthread-caption": "Biblioteca básica de hilos en C",
  "project-cthread-desc": "Biblioteca similar a PThreads para el lenguaje C. Desarrollada como parte del curso de Sistemas Operativos, proporciona funcionalidades básicas para la creación y sincronización de hilos.",

  "project-capybot-title": "CapyBot",
  "project-capybot-caption": "Asistente de IA con temática de carpincho para Slack",
  "project-capybot-desc": "Aplicación para Slack que se integra con la API de OpenAI, permitiendo al equipo interactuar con un simpático asistente de IA con temática de carpincho. Se utiliza para tareas, generación de ideas o simplemente para pasar el rato mientras se espera un despliegue.",

  "project-shrek-title": "Shrek vs Barcos de Guerra",
  "project-shrek-caption": "Un juego donde Shrek se enfrenta a una flota de barcos de guerra",
  "project-shrek-desc": "Un juego desarrollado completamente en OpenGL para demostrar conceptos clave de gráficos por ordenador como iluminación, sombreadores, texturas, detección de colisiones y curvas de Bézier. Creado como parte del curso universitario de gráficos por ordenador.",

  "project-compiler-title": "Mini Compilador",
  "project-compiler-caption": "Compilador desarrollado con Lex y Yacc",
  "project-compiler-desc": "Compilador para un lenguaje ficticio desarrollado en el curso de compiladores. Demuestra conceptos clave como análisis léxico y sintáctico, tabla de símbolos y manejo de errores.",

  "project-snake-title": "Snake",
  "project-snake-caption": "El clásico juego de móvil, ahora en tu terminal",
  "project-snake-desc": "Implementación en terminal del juego Snake, escrita en C usando la biblioteca curses para la gestión de entrada y visualización. Diseñada para practicar el control de UI a bajo nivel y la lógica del bucle de juego.",

  "formation-title": "Formación",
  "formation-course-cs": "Ciencias de la Computación",
  "formation-uni-ufrgs": "Universidad Federal de Rio Grande do Sul",
  "formation-course-sad": "Análisis y Desarrollo de Sistemas",
  "formation-uni-uniaselvi": "UNIASSELVI",

  "formation-certifications-title": "Eventos y Certificaciones",
  "formation-cert-js": "Certificación Avanzada en JavaScript",
  "formation-cert-python": "Especialización en Ciencia de Datos con Python",
  "formation-cert-ruby": "Desarrollo con Ruby on Rails",

  "languages-title": "Idiomas",
  "languages-level-label": "Nivel de dominio:",
  "language-level-beginner": "Principiante",
  "language-level-elementary": "Básico",
  "language-level-intermediate": "Intermedio",
  "language-level-advanced": "Avanzado",
  "language-level-fluent": "Fluido",

  "lang-portuguese": "Portugués",
  "lang-english": "Inglés",
  "lang-spanish": "Español",
  "lang-japanese": "Japonés",
  "lang-french": "Francés",
  "lang-catalan": "Catalán",
  "lang-german": "Alemán",
  "lang-arabic": "Árabe",

  "contact-title": "Contacto",
  "contact-description": "No dudes en ponerte en contacto conmigo a través de cualquiera de los siguientes medios:",
  "contact-email": "Correo electrónico",
  "contact-linkedin": "LinkedIn",
  "contact-github": "GitHub",

  "footer-text": "© 2024 por Felipe Graeff | Desarrollador de Software"
}
